#create power domain
create_power_domain PDLOGIC
create_power_domain PDMEM -elements {x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_tag_array_bank0_x_aq_spsram_64x58_bank0_x_aq_f_spsram_64x58_U_TS1N28HPCPLVTB64X58M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_dirty_array_x_aq_spsram_128x8_x_aq_f_spsram_128x8_U_TS1N28HPCPLVTB128X8M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_data_array_bank0_x_aq_spsram_1024x64_x_aq_f_spsram_1024x64_U_TS1N28HPCPLVTB1024X64M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_tag_array_bank1_x_aq_spsram_64x58_bank1_x_aq_f_spsram_64x58_U_TS1N28HPCPLVTB64X58M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_tag_array_bank1_x_aq_spsram_64x58_bank0_x_aq_f_spsram_64x58_U_TS1N28HPCPLVTB64X58M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_tag_array_bank0_x_aq_spsram_64x58_bank1_x_aq_f_spsram_64x58_U_TS1N28HPCPLVTB64X58M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_data_array_bank3_x_aq_spsram_1024x64_x_aq_f_spsram_1024x64_U_TS1N28HPCPLVTB1024X64M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_data_array_bank2_x_aq_spsram_1024x64_x_aq_f_spsram_1024x64_U_TS1N28HPCPLVTB1024X64M4SWBASO x_aq_top_0_x_aq_core_x_aq_lsu_top/x_aq_dcache_top_x_aq_dcache_data_array_bank1_x_aq_spsram_1024x64_x_aq_f_spsram_1024x64_U_TS1N28HPCPLVTB1024X64M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_icache_x_aq_ifu_icache_tag_array_x_aq_spsram_256x59_x_aq_f_spsram_256x59_U_TS1N28HPCPLVTB256X59M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_icache_x_aq_ifu_icache_data_array_x_aq_spsram_2048x32_3_x_aq_f_spsram_2048x32_U_TS1N28HPCPLVTB2048X32M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_icache_x_aq_ifu_icache_data_array_x_aq_spsram_2048x32_0_x_aq_f_spsram_2048x32_U_TS1N28HPCPLVTB2048X32M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_icache_x_aq_ifu_icache_data_array_x_aq_spsram_2048x32_1_x_aq_f_spsram_2048x32_U_TS1N28HPCPLVTB2048X32M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_icache_x_aq_ifu_icache_data_array_x_aq_spsram_2048x32_2_x_aq_f_spsram_2048x32_U_TS1N28HPCPLVTB2048X32M4SWBASO x_aq_top_0_x_aq_core_x_aq_ifu_top/x_aq_ifu_pred_x_aq_ifu_bht_x_aq_ifu_bht_array_x_aq_spsram_1024x16_x_aq_f_spsram_1024x16_U_TS1N28HPCPLVTB1024X16M4SWBASO x_aq_top_0_x_aq_mmu_top_x_aq_mmu_jtlb_x_aq_mmu_jtlb_data_array_x_aq_spsram_64x88_x_aq_f_spsram_64x88_U_TS1N28HPCPLVTB64X88M4SWBASO x_aq_top_0_x_aq_mmu_top_x_aq_mmu_jtlb_x_aq_mmu_jtlb_tag_array_x_aq_spsram_64x98_x_aq_f_spsram_64x98_U_TS1N28HPCPLVTB64X98M4SWBASO}



#create supply net
create_supply_net VDD_LOGIC
create_supply_net VDD_MEM
create_supply_net VSS
create_supply_net VDD_LOGIC -domain PDMEM -reuse
create_supply_net VDD_MEM -domain PDMEM -reuse
create_supply_net VSS -domain PDMEM -reuse
create_supply_port VDD_LOGIC
create_supply_port VDD_MEM
create_supply_port VSS
connect_supply_net VDD_LOGIC -port VDD_LOGIC
connect_supply_net VDD_MEM -port VDD_MEM
connect_supply_net VSS -port VSS
create_supply_set PDLOGIC_SUPPLY -function {power VDD_LOGIC} -function {ground VSS}
create_supply_set PDMEM_SUPPLY -function {power VDD_MEM} -function {ground VSS}
associate_supply_set PDLOGIC_SUPPLY -handle PDLOGIC.primary
associate_supply_set PDMEM_SUPPLY -handle PDMEM.primary


#add power state
add_power_state PDLOGIC_SUPPLY -state on {-supply_expr {power == `{FULL_ON,1.0} && ground == `{FULL_ON,0}}}
add_power_state PDMEM_SUPPLY -state on {-supply_expr {power == `{FULL_ON,0.9} && ground == `{FULL_ON,0}}}
add_power_state PDLOGIC -state on {-logic_expr {PDLOGIC_SUPPLY == on && PDMEM_SUPPLY == on}} 



set_level_shifter logic_to_sram -domain PDMEM -applies_to both -rule both -location parent
use_interface_cell logic_to_sram_lvl -domain PDMEM -strategy logic_to_sram -lib_cells {* }
